ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_fsi_tx_regs.xml
<module id="FSI_TX_REGS" HW_revision="" description="FSI TX Registers">
	<register id="TX_MAIN_CTRL" width="16" page="1" offset="0x0" internal="0" description="Transmit main control register">
		<bitfield id="CORE_RST" description="Transmitter Main Core Reset" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FLUSH" description="Flush Operation Start" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Write Key" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="TX_CLK_CTRL" width="16" page="1" offset="0x2" internal="0" description="Transmit clock control register">
		<bitfield id="CLK_RST" description="Soft Reset for the Clock Divider" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLK_EN" description="Clock Divider Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PRESCALE_VAL" description="Prescale value" begin="9" end="2" width="8" rwaccess="RW"/>
	</register>
	<register id="TX_OPER_CTRL_LO" width="16" page="1" offset="0x4" internal="0" description="Transmit operation control register low">
		<bitfield id="DATA_WIDTH" description="Transmit Data width" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SPI_MODE" description="SPI Mode Select" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="START_MODE" description="Transmission Start Mode Select" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="SW_CRC" description="CRC Source Select" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PING_TO_MODE" description="Ping Counter Reset Mode Select" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SEL_PLLCLK" description="Input Clock Select" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TDM_ENABLE" description="Transmit TDM Mode Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SEL_TDM_IN" description="Input TDM Port Select" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="TX_OPER_CTRL_HI" width="16" page="1" offset="0x5" internal="0" description="Transmit operation control register high">
		<bitfield id="FORCE_ERR" description="Error Frame Force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ECC_SEL" description="ECC Data Width Select" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EXT_TRIG_SEL" description="External Trigger Select" begin="13" end="7" width="7" rwaccess="RW"/>
	</register>
	<register id="TX_FRAME_CTRL" width="16" page="1" offset="0x6" internal="0" description="Transmit frame control register">
		<bitfield id="FRAME_TYPE" description="Transmit Frame Type" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="N_WORDS" description="Number of Words to be Transmitted" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="START" description="Start Transmission" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="TX_FRAME_TAG_UDATA" width="16" page="1" offset="0x7" internal="0" description="Transmit frame tag and user data register">
		<bitfield id="FRAME_TAG" description="Frame Tag" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="USER_DATA" description="User Data" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="TX_BUF_PTR_LOAD" width="16" page="1" offset="0x8" internal="0" description="Transmit buffer pointer control load register">
		<bitfield id="BUF_PTR_LOAD" description="Buffer Pointer Force Load " begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="TX_BUF_PTR_STS" width="16" page="1" offset="0x9" internal="0" description="Transmit buffer pointer control status register">
		<bitfield id="CURR_BUF_PTR" description="Current Buffer Pointer Index" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="CURR_WORD_CNT" description="Remaining Words in Buffer" begin="12" end="8" width="5" rwaccess="R"/>
	</register>
	<register id="TX_PING_CTRL" width="16" page="1" offset="0xa" internal="0" description="Transmit ping control register">
		<bitfield id="CNT_RST" description="Ping Counter Reset" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TIMER_EN" description="Ping Counter Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EXT_TRIG_EN" description="External Trigger Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EXT_TRIG_SEL" description="External Trigger Select" begin="9" end="3" width="7" rwaccess="RW"/>
	</register>
	<register id="TX_PING_TAG" width="16" page="1" offset="0xb" internal="0" description="Transmit ping tag register">
		<bitfield id="TAG" description="Ping Frame Tag" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="TX_PING_TO_REF" width="32" page="1" offset="0xc" internal="0" description="Transmit ping timeout counter reference">
		<bitfield id="TO_REF" description="Ping Timer Reference" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="TX_PING_TO_CNT" width="32" page="1" offset="0xe" internal="0" description="Transmit ping timeout current count">
		<bitfield id="TO_CNT" description="Ping Timer Counter" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="TX_INT_CTRL" width="16" page="1" offset="0x10" internal="0" description="Transmit interrupt event control register">
		<bitfield id="INT1_EN_FRAME_DONE" description="Enable Frame Done Interrupt to INT1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_BUF_UNDERRUN" description="Enable Buffer Underrun Interrupt to INT1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_BUF_OVERRUN" description="Enable Buffer Overrun Interrupt to INT1" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INT1_EN_PING_TO" description="Enable Ping Timer Interrupt to INT1" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_FRAME_DONE" description="Enable Frame Done Interrupt to INT2" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_BUF_UNDERRUN" description="Enable Buffer Underrun Interrupt to INT2" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_BUF_OVERRUN" description="Enable Buffer Overrun Interrupt to INT2" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INT2_EN_PING_TO" description="Enable Ping Timer Interrupt to INT2" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="TX_DMA_CTRL" width="16" page="1" offset="0x11" internal="0" description="Transmit DMA event control register">
		<bitfield id="DMA_EVT_EN" description="DMA Event Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="TX_LOCK_CTRL" width="16" page="1" offset="0x12" internal="0" description="Transmit lock control register">
		<bitfield id="LOCK" description="Control Register Lock Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Write Key" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="TX_EVT_STS" width="16" page="1" offset="0x14" internal="0" description="Transmit event and error status flag register">
		<bitfield id="FRAME_DONE" description="Frame Done Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="BUF_UNDERRUN" description="Buffer Underrun Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="BUF_OVERRUN" description="Buffer Overrun Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="PING_TRIGGERED" description="Ping Frame Triggered Flag" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="TX_EVT_CLR" width="16" page="1" offset="0x16" internal="0" description="Transmit event and error clear register">
		<bitfield id="FRAME_DONE" description="Frame Done Flag Clear " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BUF_UNDERRUN" description="Buffer Underrun Flag Clear " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="BUF_OVERRUN" description="Buffer Overrun Flag Clear " begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PING_TRIGGERED" description="Ping Frame Triggered Flag Clear " begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="TX_EVT_FRC" width="16" page="1" offset="0x17" internal="0" description="Transmit event and error flag force register">
		<bitfield id="FRAME_DONE" description="Frame Done Flag Force" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BUF_UNDERRUN" description="Buffer Underrun Flag Force" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="BUF_OVERRUN" description="Buffer Overrun Flag Force" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PING_TRIGGERED" description="Ping Frame Triggered Flag Force" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="TX_USER_CRC" width="16" page="1" offset="0x18" internal="0" description="Transmit user-defined CRC register">
		<bitfield id="USER_CRC" description="User-defined CRC" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="TX_ECC_DATA" width="32" page="1" offset="0x20" internal="0" description="Transmit ECC data register">
		<bitfield id="DATA_LOW" description="ECC Data Lower 16 Bits" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="DATA_HIGH" description="ECC Data Upper 16 Bits" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="TX_ECC_VAL" width="16" page="1" offset="0x22" internal="0" description="Transmit ECC value register">
		<bitfield id="ECC_VAL" description="Computed ECC Value" begin="6" end="0" width="7" rwaccess="R"/>
	</register>
	<register id="TX_DLYLINE_CTRL" width="16" page="1" offset="0x24" internal="0" description="Transmit delay Line control register">
		<bitfield id="TXCLK_DLY" description="Delay Line Tap Select for TXCLK" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="TXD0_DLY" description="Delay Line Tap Select for TXD0" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="TXD1_DLY" description="Delay Line Tap Select for TXD1" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="TX_BUF_BASE" width="16" page="1" offset="0x40" internal="0" description="Base address for transmit buffer">
		<bitfield id="BASE_ADDRESS" description="Transmit Data Buffer Base Address" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
</module>
